---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SkylightFailures.MinSkylightWidthMetric
source: html/2f9a6fe4-9267-91c3-4e4c-1efc4d8f68be.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SkylightFailures.MinSkylightWidthMetric Property

The minimum skylight width is 203.2 millimeters.

## Syntax (C#)
```csharp
public static FailureDefinitionId MinSkylightWidthMetric { get; }
```